---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx.LipLength
source: html/18032019-e6da-4275-4da9-0acfdfaf69de.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx.LipLength Property

Lip segment length.

## Syntax (C#)
```csharp
public double LipLength { get; set; }
```